In [1]:
import numpy as np
import pandas as pd

In [18]:
rng=np.random.RandomState(42)
ser=pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [6]:
df=pd.DataFrame(rng.randint(0,10,(3,4)),columns=['A','B','C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [7]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [8]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [4]:
area=pd.Series({'Alaska':1723337,'Texas':695662,'California':423967},name='area')
population=pd.Series({'California':38332521,'Texas':26448193,'New York':19651127},name='population')

In [6]:
population

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [7]:
area

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

In [3]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [11]:
area.index|population.index

C:\Users\zmzm1\miniconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  """Entry point for launching an IPython kernel.

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [13]:
A=pd.Series([2,4,6],index=[0,1,2])
B=pd.Series([1,3,5],index=[1,2,3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [14]:
#누락된 값은 0으로 대체한다
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [16]:
a=pd.Series([1,5])
b=pd.Series([11,1])
A=pd.DataFrame({"A":a,"B":b})
A.stack()

0  A     1
   B    11
1  A     5
   B     1
dtype: int64

In [19]:
A=pd.DataFrame(rng.randint(0,20,(2,2)),columns=list('AB'))
A

    A   B
0   6  18
1  10  10

In [20]:
B=pd.DataFrame(rng.randint(0,10,(3,3)),columns=list('BAC'))
B

   B  A  C
0  7  4  3
1  7  7  2
2  5  4  1

In [29]:
(A+B)

      A     B   C
0  10.0  25.0 NaN
1  17.0  17.0 NaN
2   NaN   NaN NaN

In [24]:
A.stack()

0  A     6
   B    18
1  A    10
   B    10
dtype: int32

In [23]:
fill=A.stack().mean()
fill

11.0

In [34]:
A.add(B,fill_value=fill)

      A     B     C
0  10.0  25.0  14.0
1  17.0  17.0  13.0
2  15.0  16.0  12.0

In [24]:
A=rng.randint(10,size=(3,4))
A

array([[1, 3, 8, 1],
       [9, 8, 9, 4],
       [1, 3, 6, 7]])

In [25]:
A-A[0]

array([[ 0,  0,  0,  0],
       [ 8,  5,  1,  3],
       [ 0,  0, -2,  6]])

In [26]:
df=pd.DataFrame(A,columns=list('QRST')) #행방향으로 연산 진행
df-df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  8  5  1  3
2  0  0 -2  6

In [27]:
df.subtract(df['R'],axis=0) #열방향으로 연산 진행

   Q  R  S  T
0 -2  0  5 -2
1  1  0  1 -4
2 -2  0  3  4

In [28]:
halfrow=df.iloc[0,::2]
halfrow

Q    1
S    8
Name: 0, dtype: int32

In [30]:
df-halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  8.0 NaN  1.0 NaN
2  0.0 NaN -2.0 NaN